docs/nguyen/org/useful_cmds.org
#+TITLE: Useful Linux/Mac Setups
#+date: <2021-01-01 03:39>
#+description: 
#+filetags: computer setup blog linux

Linux/Mac command lines and setup stuff that I find useful 

** APT
   :PROPERTIES:
   :CUSTOM_ID: apt
   :END:
   #+begin_src shell
     # shows which package owns /path/to/file
     apt-file search /path/to/file
     # allows reinstalling a package without having to remove it first (and risk removing its dependencies)
     apt-get install --reinstall packagename
     apt-file list packagename
     apt-show-versions | grep unstable
     apt-get build-dep packagename
   #+end_src

** Development
   :PROPERTIES:
   :CUSTOM_ID: development
   :END:
*** JAVA
    :PROPERTIES:
    :CUSTOM_ID: java
    :END:

    - Install Sun/Oracle's JDK

    #+begin_src shell
      # First add "contrib" to /etc/apt-sources.list
      # Then
      apt-get update & apt-get install java-package
      make-jpkg /path/to/jdk-*-linux-x64.tar.gz
      dpkg -i oracle-java-*_amd64.deb
    #+end_src

** Administration
   :PROPERTIES:
   :CUSTOM_ID: administration
   :END:
*** Email
    :PROPERTIES:
    :CUSTOM_ID: email
    :END:
    We use =ssmtp= to send emails. The following uses *Gmail*'s server.

    1. After installing, edit the =/etc/ssmtp/ssmtp.conf= file

       #+begin_example
         root=username@gmail.com
         mailhub=smtp.gmail.com:587
         rewriteDomain=
         hostname=fileserver.local
         UseSTARTTLS=YES
         AuthUser=username
         AuthPass=password
         FromLineOverride=YES
       #+end_example

    2. Now edit =/etc/ssmtp/revaliases= to add accounts that we want to be
       able to send mails. For example,

       #+begin_src shell
         root:nguyenthanhvuh@gmail.com:smtp.gmail.com:587
         auser:nguyenthanhvuh@gmail.com:smtp.gmail.com:587
       #+end_src

    3. Finally, we can test sending mails

       #+begin_src shell
         $ echo "test" | mail -v -s "testing ssmtp setup" tnguyen@cs.umd.edu
         $ echo "Do this" | mail -s "Todo" nguyenthanhvuh@gmail.com
         $ echo "A TEST" > afile
         $ mail -s "Todo" nguyenthanhvuh@gmail.com < afile
       #+end_src

*** RAID
    :PROPERTIES:
    :CUSTOM_ID: raid
    :END:
    This is for RAID-5 setup, which requires a minimum of 3 drives. The
    *usable space* is =(number of drives - 1) * size of smallest drive=.
    Here we will use =mdm= to manage our RAID setup
    (=apt-get install mdadm=).

    To create new drive partitions in the RAID array, we can use =fdisk= or
    =parted= (if the disk size > 2 terabytes). If use =fdisk= then choose
    the partition type to be raid (type =fd=). Now assume we want to use the
    4 partitions =sdc1, sdc1, sde1=, and =sdf1=.

    #+begin_src shell
      # build the RAID array
      mdadm --create --verbose /dev/md0 --level=5 --raid-devices=4 /dev/sd[cdef]1

      # it will take some time to build the array, we can watch its status with
      watch cat /proc/mdstat

      #once the array is built, we can check with
      mdadm --detail /dev/md0

      /dev/md0:
      Version : 1.2
      Creation Time : Fri Jun 24 15:04:32 2016
      Raid Level : raid5
      Array Size : 734954496 (700.91 GiB 752.59 GB)
      Used Dev Size : 244984832 (233.64 GiB 250.86 GB)
      Raid Devices : 4
      Total Devices : 4
      Persistence : Superblock is persistent

      Intent Bitmap : Internal

      Update Time : Sat Jun 25 00:34:10 2016
      State : clean
      Active Devices : 4
      Working Devices : 4
      Failed Devices : 0
      Spare Devices : 0

      Layout : left-symmetric
      Chunk Size : 512K

      Name : GiaoChi:0
      UUID : 1d431c63:a9fe7dca:ffb4dca5:58391d2e
      Events : 1097

      Number   Major   Minor   RaidDevice State
      0     8     33    0    active sync   /dev/sdc1
      1     8     49    1    active sync   /dev/sdd1
      2     8     65    2    active sync   /dev/sde1
      4     8     81    3    active sync   /dev/sdf1


      # create file extension and mount
      mkfs.ext4 /dev/md0
      mkdir /MYNEWSTORAGE
      # in /etc/fstab
      /dev/md0    /MYNEWSTORAGE      ext4    defaults    0    0
      # finally mount the array so that we can being to access /MYNEWSTORAGE
      mount -av

      #edit configuration files so that mdm knows how to assemble the array when the system boots
      echo "DEVICE partitions" > /etc/mdadm/mdadm.conf
      echo "HOMEHOST fileserver" >> /etc/mdadm/mdadm.conf
      echo "MAILADDR username@gmail.com" >> /etc/mdadm/mdadm.conf
      mdadm --detail --scan --verbose >> /etc/mdadm/mdadm.conf
    #+end_src

*** GPG
    :PROPERTIES:
    :CUSTOM_ID: gpg
    :END:
    #+begin_src shell
      gpg --gen-key
      gpg --export  -a "Name" > pub.key
      gpg --export-secret-key -a "Name" > priv.key
      gpg --import priv.key
      gpg --list-keys
      gpg --list-secret-keys
      gpg --delete-key "Name"
      gpg --delete-secret-key "Name"
      gpg --edit-key "Name"  #here you can change passphrase of priv key with passwd
    #+end_src

** Remote Login
   :PROPERTIES:
   :CUSTOM_ID: remote-login
   :END:
