people/nguyenthanhvuh/old/posts/useful_cmds.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="./rss.xml"
      title="RSS feed for ./">
<title>Useful Linux/Mac Setups</title>
<meta name="author" content="ThanhVu Nguyen">
<meta name="referrer" content="no-referrer">
<link rel="stylesheet" type="text/css" href="https://dynaroars.github.io/files/org.css" />
<link href= "../files/org-orig.css" rel="stylesheet" type="text/css" /> 
<link rel="icon" href="../files/favicon.ico">
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="../index.html">ThanhVu Nguyen</a>,  
  <a href="index.html">Archive</a>
</div>
</div>
<div id="content">
<div class="post-date">01 Jan 2021</div><h1 class="post-title"><a href="./useful_cmds.html">Useful Linux/Mac Setups</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#apt">1. APT</a></li>
<li><a href="#development">2. Development</a>
<ul>
<li><a href="#java">2.1. JAVA</a></li>
</ul>
</li>
<li><a href="#administration">3. Administration</a>
<ul>
<li><a href="#email">3.1. Email</a></li>
<li><a href="#raid">3.2. RAID</a></li>
<li><a href="#gpg">3.3. GPG</a></li>
</ul>
</li>
<li><a href="#remote-login">4. Remote Login</a>
<ul>
<li><a href="#ssh">4.1. SSH</a></li>
</ul>
</li>
<li><a href="#files">5. Files</a></li>
<li><a href="#misc">6. Misc</a>
<ul>
<li><a href="#benchmarks">6.1. Benchmarks</a></li>
<li><a href="#keyboard">6.2. Keyboard</a></li>
<li><a href="#multimedia">6.3. Multimedia</a></li>
<li><a href="#update-date-on-debian">6.4. Update <code>date</code> on Debian</a></li>
<li><a href="#users">6.5. Users</a></li>
</ul>
</li>
<li><a href="#web">7. Web</a>
<ul>
<li><a href="#website">7.1. Website</a></li>
<li><a href="#webserver">7.2. Webserver</a></li>
<li><a href="#table-of-contents-in-markdown">7.3. Table of Contents in Markdown</a></li>
</ul>
</li>
<li><a href="#mac-os">8. MAC OS</a></li>
<li><a href="#virtual-box">9. Virtual Box</a></li>
<li><a href="#emacs">10. Emacs</a>
<ul>
<li><a href="#useful-keys">10.1. Useful keys</a></li>
<li><a href="#tex">10.2. TeX</a></li>
<li><a href="#install-flyspell-on-mac">10.3. Install Flyspell on Mac</a></li>
<li><a href="#texlive">10.4. TexLive</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
Linux/Mac command lines and setup stuff that I find useful 
</p>

<div id="outline-container-apt" class="outline-2">
<h2 id="apt"><span class="section-number-2">1.</span> APT</h2>
<div class="outline-text-2" id="text-apt">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">shows which package owns /path/to/file</span>
apt-file search /path/to/file
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">allows reinstalling a package without having to remove it first (and risk removing its dependencies)</span>
apt-get install --reinstall packagename
apt-file list packagename
apt-show-versions | grep unstable
apt-get build-dep packagename
</pre>
</div>
</div>
</div>

<div id="outline-container-development" class="outline-2">
<h2 id="development"><span class="section-number-2">2.</span> Development</h2>
<div class="outline-text-2" id="text-development">
</div>
<div id="outline-container-java" class="outline-3">
<h3 id="java"><span class="section-number-3">2.1.</span> JAVA</h3>
<div class="outline-text-3" id="text-java">
<ul class="org-ul">
<li>Install Sun/Oracle's JDK</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">First add "contrib" to /etc/apt-sources.list</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Then</span>
apt-get update &amp; apt-get install java-package
make-jpkg /path/to/jdk-*-linux-x64.tar.gz
dpkg -i oracle-java-*_amd64.deb
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-administration" class="outline-2">
<h2 id="administration"><span class="section-number-2">3.</span> Administration</h2>
<div class="outline-text-2" id="text-administration">
</div>
<div id="outline-container-email" class="outline-3">
<h3 id="email"><span class="section-number-3">3.1.</span> Email</h3>
<div class="outline-text-3" id="text-email">
<p>
We use <code>ssmtp</code> to send emails. The following uses <b>Gmail</b>'s server.
</p>

<ol class="org-ol">
<li><p>
After installing, edit the <code>/etc/ssmtp/ssmtp.conf</code> file
</p>

<pre class="example" id="orgb37d727">
root=username@gmail.com
mailhub=smtp.gmail.com:587
rewriteDomain=
hostname=fileserver.local
UseSTARTTLS=YES
AuthUser=username
AuthPass=password
FromLineOverride=YES
</pre></li>

<li><p>
Now edit <code>/etc/ssmtp/revaliases</code> to add accounts that we want to be
able to send mails. For example,
</p>

<div class="org-src-container">
<pre class="src src-shell">root:nguyenthanhvuh@gmail.com:smtp.gmail.com:587
auser:nguyenthanhvuh@gmail.com:smtp.gmail.com:587
</pre>
</div></li>

<li><p>
Finally, we can test sending mails
</p>

<div class="org-src-container">
<pre class="src src-shell">$ echo <span style="color: #98be65;">"test"</span> | mail -v -s <span style="color: #98be65;">"testing ssmtp setup"</span> tnguyen@cs.umd.edu
$ echo <span style="color: #98be65;">"Do this"</span> | mail -s <span style="color: #98be65;">"Todo"</span> nguyenthanhvuh@gmail.com
$ echo <span style="color: #98be65;">"A TEST"</span> &gt; afile
$ mail -s <span style="color: #98be65;">"Todo"</span> nguyenthanhvuh@gmail.com &lt; afile
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-raid" class="outline-3">
<h3 id="raid"><span class="section-number-3">3.2.</span> RAID</h3>
<div class="outline-text-3" id="text-raid">
<p>
This is for RAID-5 setup, which requires a minimum of 3 drives. The
<b>usable space</b> is <code>(number of drives - 1) * size of smallest drive</code>.
Here we will use <code>mdm</code> to manage our RAID setup
(<code>apt-get install mdadm</code>).
</p>

<p>
To create new drive partitions in the RAID array, we can use <code>fdisk</code> or
<code>parted</code> (if the disk size &gt; 2 terabytes). If use <code>fdisk</code> then choose
the partition type to be raid (type <code>fd</code>). Now assume we want to use the
4 partitions <code>sdc1, sdc1, sde1</code>, and <code>sdf1</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">build the RAID array</span>
mdadm --create --verbose /dev/md0 --level=5 --raid-devices=4 /dev/sd[cdef]1

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">it will take some time to build the array, we can watch its status with</span>
watch cat /proc/mdstat

<span style="color: #5B6268;">#</span><span style="color: #5B6268;">once the array is built, we can check with</span>
mdadm --detail /dev/md0

/dev/md0:
Version : 1.2
Creation Time : Fri Jun 24 15:04:32 2016
Raid Level : raid5
Array Size : 734954496 (700.91 GiB 752.59 GB)
Used Dev Size : 244984832 (233.64 GiB 250.86 GB)
Raid Devices : 4
Total Devices : 4
Persistence : Superblock is persistent

Intent Bitmap : Internal

Update Time : Sat Jun 25 00:34:10 2016
State : clean
Active Devices : 4
Working Devices : 4
Failed Devices : 0
Spare Devices : 0

Layout : left-symmetric
Chunk Size : 512K

Name : GiaoChi:0
UUID : 1d431c63:a9fe7dca:ffb4dca5:58391d2e
Events : 1097

Number   Major   Minor   RaidDevice State
0     8     33    0    active sync   /dev/sdc1
1     8     49    1    active sync   /dev/sdd1
2     8     65    2    active sync   /dev/sde1
4     8     81    3    active sync   /dev/sdf1


<span style="color: #5B6268;"># </span><span style="color: #5B6268;">create file extension and mount</span>
mkfs.ext4 /dev/md0
mkdir /MYNEWSTORAGE
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">in /etc/fstab</span>
/dev/md0    /MYNEWSTORAGE      ext4    defaults    0    0
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">finally mount the array so that we can being to access /MYNEWSTORAGE</span>
mount -av

<span style="color: #5B6268;">#</span><span style="color: #5B6268;">edit configuration files so that mdm knows how to assemble the array when the system boots</span>
<span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"DEVICE partitions"</span> &gt; /etc/mdadm/mdadm.conf
<span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"HOMEHOST fileserver"</span> &gt;&gt; /etc/mdadm/mdadm.conf
<span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"MAILADDR username@gmail.com"</span> &gt;&gt; /etc/mdadm/mdadm.conf
mdadm --detail --scan --verbose &gt;&gt; /etc/mdadm/mdadm.conf
</pre>
</div>
</div>
</div>

<div id="outline-container-gpg" class="outline-3">
<h3 id="gpg"><span class="section-number-3">3.3.</span> GPG</h3>
<div class="outline-text-3" id="text-gpg">
<div class="org-src-container">
<pre class="src src-shell">gpg --gen-key
gpg --export  -a <span style="color: #98be65;">"Name"</span> &gt; pub.key
gpg --export-secret-key -a <span style="color: #98be65;">"Name"</span> &gt; priv.key
gpg --import priv.key
gpg --list-keys
gpg --list-secret-keys
gpg --delete-key <span style="color: #98be65;">"Name"</span>
gpg --delete-secret-key <span style="color: #98be65;">"Name"</span>
gpg --edit-key <span style="color: #98be65;">"Name"</span>  <span style="color: #5B6268;">#</span><span style="color: #5B6268;">here you can change passphrase of priv key with passwd</span>
</pre>
</div>
</div>
</div>
</div>
