docs/nguyen/org/useful_cmds.org
*** SSH
    :PROPERTIES:
    :CUSTOM_ID: ssh
    :END:

    1. Generate password-less SSH public key

       1. From a terminal, type =ssh-keygen -t rsa= and hit =Enter= on most
          questions, *even when it asks for password*, i.e., leave the
          password blank. This allows to log in account from your machine
          without requiring password.
       2. The public key is stored at =~/.ssh/id_rsa.pub=
       3. *Tips*:

          - Add you SSH public key to code repo (e.g., Github, Bitbucket).
            This allows you to modify projects (e.g., push) without having
            to enter username and password.
          - You can also use this key to ssh into other machine without
            having to enter password (see *password-less login* below)

    2. Password-less login

       To ssh login the server =host= without having to enter a password:

       #+begin_src shell
         $ cat ~/.ssh/id_rsa.pub | ssh username@host 'cat >> ~/.ssh/authorized_keys'
       #+end_src

    3. Miscs:

       - SSH session disconnected and got stuck: type =Enter ~ .=

    4. Mmulti-hop ssh e.g., ssh to =user1@host1:port1= and then ssh to
       =user2@host2:port2= (as =user1@host1=:).

       #+begin_src shell
         # This method uses ProxyJump
         # add the following entry to file ~/.ssh/config
         Host AName
         Hostname host1
         Port port1
         User user1
         ProxyJump user2@host2:port2

         $ ssh user2@AName
         # first password asked is for user1@host1, second password asked is for user2@host2.


         # This second method uses netcat (the nc command) and ProxyCommand
         # add the following entry to file ~/.ssh/config
         Host AName
         Hostname host1
         ProxyCommand ssh -q user1@host1 -p port1 nc host2 port2
         StrictHostKeyChecking no
         UserKnownHostsFile=/dev/null

         $ ssh user2@AName
         # first password asked is for user1@host1, second password asked is for user2@host2
       #+end_src

    - using =scp=

    #+begin_src shell
      scp -P port_number username@host:/path/to/file /destination/dir
    #+end_src

    - using =rsync= resume file transfer

      #+begin_src shell
        rsync --partial --progress --rsh=ssh user@host:/path/to/file .
      #+end_src

    - using =sshfs= to mount remote directories > source:
      [[https://linuxize.com/post/how-to-use-sshfs-to-mount-remote-directories-over-ssh/]]

      1. Install =SSHFS=

         - For Debian

           #+begin_src shell
             $ sudo apt install sshf
           #+end_src

         - For Mac

           #+begin_src shell
             $ brew cask install osxfuse
             $ brew install sshfs
           #+end_src

      - Mount remote directories (*tip*: use password-less SSH to avoid
        entering password)
        =shell       # sshfs [user@]host:[remote_directory] mountpoint [options]       # E.g.,       $ sshfs username@hostname:/home/dir1 /home/dir1/dir2       $ sshfs localhost:/home/tnguyen/Dropbox local2222/ -C -p 2222=

** Files
   :PROPERTIES:
   :CUSTOM_ID: files
   :END:

   - move

     #+begin_src shell
       #move with overwrite (and will not ask for confirmation)
       mv -f

       #do *not* overwrite (and will not ask for confirmation)
       mv -n
     #+end_src

   - sync

     #+begin_src shell
       #sync dirs
       #todir will become exactly like fromdir
       rsync -val --delete --exclude "*.ext"  --exclude "dir" fromdir todir

       #syn website
       #I use the this command to synchronize my webpages to the university server
       rsync -azv --delete --exclude=.hg --exclude=.hgcheck -e ssh ~/www tnguyen@cse.unl.edu:/home/fac/tnguyen/public_html/
     #+end_src

   - recursively change directory whose permision is 777 to 755

     #+begin_src shell
       find . -type d -perm 777 -print -exec chmod 755 {} \;
     #+end_src

   - recursively delete files with extensions *.ext

     #+begin_src shell
       find -name \*.ext -delete
     #+end_src

   - change permission

     #+begin_src shell
       # change dir to 0755
       $ find /path -type d -print0 | xargs -0 chmod 0755

       # change file to 0644
       $ find /path -type f -print0 | xargs -0 chmod 0644
     #+end_src

   - Dropbox find conflicts

     #+begin_src shell
       find ~/Dropbox/ -path "*(*'s conflicted copy [0-9][0-9][0-9][0-9]-[0-9][0-9]-[0-9][0-9]*" -print
     #+end_src

   - grep

     #+begin_src shell
       grep "error" file.txt | grep -v "multiple output" | grep -v "notexist"
       grep -A 10 -B 10 "hello world" file.txt:  output surrounding lines
     #+end_src

** Misc
   :PROPERTIES:
   :CUSTOM_ID: misc
   :END:

   - Convert JPG's to pdf: use the =convert= command from =imagemagick=,
     works with various types of files and not just =jpg's=.

     #+begin_src shell
       $ convert -auto-orient *.jpg notes.pdf
     #+end_src

*** Benchmarks
    :PROPERTIES:
    :CUSTOM_ID: benchmarks
    :END:

    - CPU

      #+begin_src shell
        echo '2^2^25' | time -p bc > /dev/null
        time -p echo "scale=5000; a(1)*4" | bc -l
        sysbench --test=cpu --cpu-max-prime=20000 run #apt-get install sysbench
      #+end_src

*** Keyboard
    :PROPERTIES:
    :CUSTOM_ID: keyboard
    :END:

    - permanent switching =capslock= and =control= keys

      #+begin_src shell
        #add/replace to /etc/default/keyboard
        XKBOPTIONS="ctrl:nocaps" # Some people prefer "ctrl:swapcaps"
        sudo dpkg-reconfigure -phigh console-setup
      #+end_src

    - Emacs key in XFCE

      #+begin_src shell
        $ xfconf-query -c xsettings -p /Gtk/KeyThemeName -s Emacs
        OR
        Menu -> Settings -> Settings Editor -> xsettings -> Gtk -> KeyThemeName,  enter Emacs in the field
      #+end_src

