people/nguyenthanhvuh/old/posts/useful_cmds.html

<div id="outline-container-remote-login" class="outline-2">
<h2 id="remote-login"><span class="section-number-2">4.</span> Remote Login</h2>
<div class="outline-text-2" id="text-remote-login">
</div>
<div id="outline-container-ssh" class="outline-3">
<h3 id="ssh"><span class="section-number-3">4.1.</span> SSH</h3>
<div class="outline-text-3" id="text-ssh">
<ol class="org-ol">
<li>Generate password-less SSH public key

<ol class="org-ol">
<li>From a terminal, type <code>ssh-keygen -t rsa</code> and hit <code>Enter</code> on most
questions, <b>even when it asks for password</b>, i.e., leave the
password blank. This allows to log in account from your machine
without requiring password.</li>
<li>The public key is stored at <code>~/.ssh/id_rsa.pub</code></li>
<li><b>Tips</b>:

<ul class="org-ul">
<li>Add you SSH public key to code repo (e.g., Github, Bitbucket).
This allows you to modify projects (e.g., push) without having
to enter username and password.</li>
<li>You can also use this key to ssh into other machine without
having to enter password (see <b>password-less login</b> below)</li>
</ul></li>
</ol></li>

<li><p>
Password-less login
</p>

<p>
To ssh login the server <code>host</code> without having to enter a password:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cat ~/.ssh/id_rsa.pub | ssh username@host <span style="color: #98be65;">'cat &gt;&gt; ~/.ssh/authorized_keys'</span>
</pre>
</div></li>

<li>Miscs:

<ul class="org-ul">
<li>SSH session disconnected and got stuck: type <code>Enter ~ .</code></li>
</ul></li>

<li><p>
Mmulti-hop ssh e.g., ssh to <code>user1@host1:port1</code> and then ssh to
<code>user2@host2:port2</code> (as <code>user1@host1</code>:).
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">This method uses ProxyJump</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">add the following entry to file ~/.ssh/config</span>
Host AName
Hostname host1
Port port1
User user1
ProxyJump user2@host2:port2

$ ssh user2@AName
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">first password asked is for user1@host1, second password asked is for user2@host2.</span>


<span style="color: #5B6268;"># </span><span style="color: #5B6268;">This second method uses netcat (the nc command) and ProxyCommand</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">add the following entry to file ~/.ssh/config</span>
Host AName
Hostname host1
ProxyCommand ssh -q user1@host1 -p port1 nc host2 port2
StrictHostKeyChecking no
<span style="color: #dcaeea;">UserKnownHostsFile</span>=/dev/null

$ ssh user2@AName
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">first password asked is for user1@host1, second password asked is for user2@host2</span>
</pre>
</div></li>

<li>using <code>scp</code></li>
</ol>

<div class="org-src-container">
<pre class="src src-shell">scp -P port_number username@host:/path/to/file /destination/dir
</pre>
</div>

<ul class="org-ul">
<li><p>
using <code>rsync</code> resume file transfer
</p>

<div class="org-src-container">
<pre class="src src-shell">rsync --partial --progress --rsh=ssh user@host:/path/to/file .
</pre>
</div></li>

<li>using <code>sshfs</code> to mount remote directories &gt; source:
<a href="https://linuxize.com/post/how-to-use-sshfs-to-mount-remote-directories-over-ssh/">https://linuxize.com/post/how-to-use-sshfs-to-mount-remote-directories-over-ssh/</a>

<ol class="org-ol">
<li>Install <code>SSHFS</code>

<ul class="org-ul">
<li><p>
For Debian
</p>

<div class="org-src-container">
<pre class="src src-shell">$ sudo apt install sshf
</pre>
</div></li>

<li><p>
For Mac
</p>

<div class="org-src-container">
<pre class="src src-shell">$ brew cask install osxfuse
$ brew install sshfs
</pre>
</div></li>
</ul></li>

<li>Mount remote directories (<b>tip</b>: use password-less SSH to avoid
entering password)
<code>shell       # sshfs [user@]host:[remote_directory] mountpoint [options]       # E.g.,       $ sshfs username@hostname:/home/dir1 /home/dir1/dir2       $ sshfs localhost:/home/tnguyen/Dropbox local2222/ -C -p 2222</code></li>
</ol></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-files" class="outline-2">
<h2 id="files"><span class="section-number-2">5.</span> Files</h2>
<div class="outline-text-2" id="text-files">
<ul class="org-ul">
<li><p>
move
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;">#</span><span style="color: #5B6268;">move with overwrite (and will not ask for confirmation)</span>
mv -f

<span style="color: #5B6268;">#</span><span style="color: #5B6268;">do *not* overwrite (and will not ask for confirmation)</span>
mv -n
</pre>
</div></li>

<li><p>
sync
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;">#</span><span style="color: #5B6268;">sync dirs</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">todir will become exactly like fromdir</span>
rsync -val --delete --exclude <span style="color: #98be65;">"*.ext"</span>  --exclude <span style="color: #98be65;">"dir"</span> fromdir todir

<span style="color: #5B6268;">#</span><span style="color: #5B6268;">syn website</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">I use the this command to synchronize my webpages to the university server</span>
rsync -azv --delete --exclude=.hg --exclude=.hgcheck -e ssh ~/www tnguyen@cse.unl.edu:/home/fac/tnguyen/public_html/
</pre>
</div></li>

<li><p>
recursively change directory whose permision is 777 to 755
</p>

<div class="org-src-container">
<pre class="src src-shell">find . -type d -perm 777 -print -exec chmod 755 {} <span style="color: #98be65;">\;</span>
</pre>
</div></li>

<li><p>
recursively delete files with extensions *.ext
</p>

<div class="org-src-container">
<pre class="src src-shell">find -name <span style="color: #98be65;">\*</span>.ext -delete
</pre>
</div></li>

<li><p>
change permission
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">change dir to 0755</span>
$ find /path -type d -print0 | xargs -0 chmod 0755

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">change file to 0644</span>
$ find /path -type f -print0 | xargs -0 chmod 0644
</pre>
</div></li>

<li><p>
Dropbox find conflicts
</p>

<div class="org-src-container">
<pre class="src src-shell">find ~/Dropbox/ -path <span style="color: #98be65;">"*(*'s conflicted copy [0-9][0-9][0-9][0-9]-[0-9][0-9]-[0-9][0-9]*"</span> -print
</pre>
</div></li>

<li><p>
grep
</p>

<div class="org-src-container">
<pre class="src src-shell">grep <span style="color: #98be65;">"error"</span> file.txt | grep -v <span style="color: #98be65;">"multiple output"</span> | grep -v <span style="color: #98be65;">"notexist"</span>
grep -A 10 -B 10 <span style="color: #98be65;">"hello world"</span> file.txt:  output surrounding lines
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-misc" class="outline-2">
<h2 id="misc"><span class="section-number-2">6.</span> Misc</h2>
<div class="outline-text-2" id="text-misc">
<ul class="org-ul">
<li><p>
Convert JPG's to pdf: use the <code>convert</code> command from <code>imagemagick</code>,
works with various types of files and not just <code>jpg's</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell">$ convert -auto-orient *.jpg notes.pdf
</pre>
</div></li>
</ul>
</div>

<div id="outline-container-benchmarks" class="outline-3">
<h3 id="benchmarks"><span class="section-number-3">6.1.</span> Benchmarks</h3>
<div class="outline-text-3" id="text-benchmarks">
<ul class="org-ul">
<li><p>
CPU
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">echo</span> <span style="color: #98be65;">'2^2^25'</span> | time -p bc &gt; /dev/null
time -p echo <span style="color: #98be65;">"scale=5000; a(1)*4"</span> | bc -l
sysbench --test=cpu --cpu-max-prime=20000 run <span style="color: #5B6268;">#</span><span style="color: #5B6268;">apt-get install sysbench</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-keyboard" class="outline-3">
<h3 id="keyboard"><span class="section-number-3">6.2.</span> Keyboard</h3>
<div class="outline-text-3" id="text-keyboard">
<ul class="org-ul">
<li><p>
permanent switching <code>capslock</code> and <code>control</code> keys
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;">#</span><span style="color: #5B6268;">add/replace to /etc/default/keyboard</span>
<span style="color: #dcaeea;">XKBOPTIONS</span>=<span style="color: #98be65;">"ctrl:nocaps"</span> <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Some people prefer "ctrl:swapcaps"</span>
sudo dpkg-reconfigure -phigh console-setup
</pre>
</div></li>

<li><p>
Emacs key in XFCE
</p>

<div class="org-src-container">
<pre class="src src-shell">$ xfconf-query -c xsettings -p /Gtk/KeyThemeName -s Emacs
OR
Menu -&gt; Settings -&gt; Settings Editor -&gt; xsettings -&gt; Gtk -&gt; KeyThemeName,  enter Emacs<span style="color: #51afef;"> in</span> the field
</pre>
</div></li>
</ul>
</div>
</div>
