docs/nguyen/org/useful_cmds.org
*** Multimedia
    :PROPERTIES:
    :CUSTOM_ID: multimedia
    :END:

    - Burn videos, e.g., mpg, to DVD
      ([[http://www.lamolabs.org/blog/author/slmingol/]])

      - convert video with ffmpeg

        #+begin_src shell
          ffmpeg -i input.m4v -target ntsc-dvd output.mpg
        #+end_src

      - do authoring

        #+begin_src shell
          dvdauthor --title -o dvd -f output.mpg
          dvdauthor -o dvd -T
          # NOTE: --title sets the title of the DVD, -T sets the table of contents. In both
          #     above commands the -o switch is referencing a directory, NOT the actual dvd.
        #+end_src

      - roll the .mpg file into an ISO file

        #+begin_src shell
          mkisofs -dvd-video -o dvdimage.iso dvd
          # NOTE: mkisofs is making an actual DVD video ISO file using the directory, dvd.
        #+end_src

      - burn ISO to DVD

        #+begin_src shell
          growisofs -speed=1 -dvd-compat -Z /dev/dvd=dvdimage.iso
          NOTE: -speed=1 is for use with lower quality discs, increase as necessary
          NOTE: This approach can be used to convert basically any format (m4v, mp4, etc.) to a DVD. Simply change the input file accordingly.
        #+end_src

*** Update =date= on Debian
    :PROPERTIES:
    :CUSTOM_ID: update-date-on-debian
    :END:

    - Note: =ntpdate= is deprecated, use =ntp= instead
      =shell     sudo service ntp stop     sudo ntpd -gq     sudo service ntp start=

    - The =-gq= tells the ntp daemon to correct the time regardless of the
      offset (=g=) and exit immediately (=q=) after setting the time.

*** Users
    :PROPERTIES:
    :CUSTOM_ID: users
    :END:

    - Add user to sudo =shell sudo adduser username sudo=

    - Change username from /olduser/ to /newuser/.
      =shell     # make sure olduser is not logged in or using any process, e.g., restart and log in as another user.     $ sudo usermod -l newuser olduser     $ sudo groupmod -n newuser olduser     $ sudo usermod -d /home/newuser -m newuser=

    - Disable users
      =shell     passwd -l username  to lock , passwd -u username to unlock=

** Web
   :PROPERTIES:
   :CUSTOM_ID: web
   :END:
*** Website
    :PROPERTIES:
    :CUSTOM_ID: website
    :END:

    - Password Protected Website

      #+begin_src shell
        # To protect a directory called 'SecDir' on your website,
        # go to SecDir and create/edit .htaccess file as follows:
        AuthName "MySecDir"
        AuthType Basic
        AuthUserFile /path/to/.htpasswd
        require valid-user

        $ htpasswd -c /path/to/.htpasswd guestname #create a passwod
        $ chmod 644 /path/to/.htpasswd   #change permission

        # to log in SecDir online, enter username: guestname and passwod: yourpass
      #+end_src

*** Webserver
    :PROPERTIES:
    :CUSTOM_ID: webserver
    :END:

    - Run a local server
      #+begin_src 
      $ cd /path/to/dir     
      $ python -m SimpleHTTPServer #optional, can also enter the port e.g., 8080
      #+end_src


*** Table of Contents in Markdown
    :PROPERTIES:
    :CUSTOM_ID: table-of-contents-in-markdown
    :END:

    - Use =gh-md-toc=, e.g.,  =$ gh-md-toc --insert cmds.md=

** MAC OS
   :PROPERTIES:
   :CUSTOM_ID: mac-os
   :END:

   - Creating an ISO from a CD/DVD e.g., to back up CD
     #+begin_src 
     - Insert CD
     - open Disk Utils
     - Select the CD (not the drive)
     - Create File / New / Disk Image from ... / 
     - Image Format:  CD/DVD Master  ...
     - rename cdr to iso
     #+end_src


   - Burn ISO image to USB (e.g., to install Linux distribution from USB)

     - First convert ISO to dmg file
       #+begin_src 
       $ hdiutil convert -format UDRW -o ~/file.img ~/file.iso     
       ...
       Speed: 427.5Mbytes/sec     Savings: 0.0%     created: ~/file.img.dmg
       #+end_src

     - Then find the USB device
       #+begin_src shell
         $ diskutil list
         /dev/disk0
         #:             TYPE NAME          SIZE     IDENTIFIER
         0:    GUID_partition_scheme            *320.1 GB   disk0
         1:            EFI             209.7 MB   disk0s1
         2:          Apple_HFS Mac           319.7 GB   disk0s2
         /dev/disk1
         #:             TYPE NAME          SIZE     IDENTIFIER
         0:   FDisk_partition_scheme            *2.0 GB   disk1
         1:       Windows_FAT_32             2.0 GB   disk1s1

         $ diskutil unmountDisk /dev/disk1
         Unmount of all volumes on disk1 was successful
       #+end_src

     - Finally, copy data to USB disk

       #+begin_src shell
         $ sudo dd if=/Users/tnguyen/file.img.dmg of=/dev/disk1 bs=1m
         687+1 records in
         687+1 records out
         721127424 bytes transferred in 77.176835 secs (9343833 bytes/sec)

         $ diskutil eject /dev/disk1
         Disk /dev/disk1 ejected
       #+end_src

