people/nguyenthanhvuh/old/posts/useful_cmds.html

<div id="outline-container-multimedia" class="outline-3">
<h3 id="multimedia"><span class="section-number-3">6.3.</span> Multimedia</h3>
<div class="outline-text-3" id="text-multimedia">
<ul class="org-ul">
<li>Burn videos, e.g., mpg, to DVD
(<a href="http://www.lamolabs.org/blog/author/slmingol/">http://www.lamolabs.org/blog/author/slmingol/</a>)

<ul class="org-ul">
<li><p>
convert video with ffmpeg
</p>

<div class="org-src-container">
<pre class="src src-shell">ffmpeg -i input.m4v -target ntsc-dvd output.mpg
</pre>
</div></li>

<li><p>
do authoring
</p>

<div class="org-src-container">
<pre class="src src-shell">dvdauthor --title -o dvd -f output.mpg
dvdauthor -o dvd -T
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">NOTE: --title sets the title of the DVD, -T sets the table of contents. In both</span>
<span style="color: #5B6268;">#     </span><span style="color: #5B6268;">above commands the -o switch is referencing a directory, NOT the actual dvd.</span>
</pre>
</div></li>

<li><p>
roll the .mpg file into an ISO file
</p>

<div class="org-src-container">
<pre class="src src-shell">mkisofs -dvd-video -o dvdimage.iso dvd
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">NOTE: mkisofs is making an actual DVD video ISO file using the directory, dvd.</span>
</pre>
</div></li>

<li><p>
burn ISO to DVD
</p>

<div class="org-src-container">
<pre class="src src-shell">growisofs -speed=1 -dvd-compat -Z /dev/dvd=dvdimage.iso
NOTE: -speed=1 is for use with lower quality discs, increase as necessary
NOTE: This approach can be used to convert basically any format (m4v, mp4, etc.) to a DVD. Simply change the input file accordingly.
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-update-date-on-debian" class="outline-3">
<h3 id="update-date-on-debian"><span class="section-number-3">6.4.</span> Update <code>date</code> on Debian</h3>
<div class="outline-text-3" id="text-update-date-on-debian">
<ul class="org-ul">
<li>Note: <code>ntpdate</code> is deprecated, use <code>ntp</code> instead
<code>shell     sudo service ntp stop     sudo ntpd -gq     sudo service ntp start</code></li>

<li>The <code>-gq</code> tells the ntp daemon to correct the time regardless of the
offset (<code>g</code>) and exit immediately (<code>q</code>) after setting the time.</li>
</ul>
</div>
</div>

<div id="outline-container-users" class="outline-3">
<h3 id="users"><span class="section-number-3">6.5.</span> Users</h3>
<div class="outline-text-3" id="text-users">
<ul class="org-ul">
<li>Add user to sudo <code>shell sudo adduser username sudo</code></li>

<li>Change username from <i>olduser</i> to <i>newuser</i>.
<code>shell     # make sure olduser is not logged in or using any process, e.g., restart and log in as another user.     $ sudo usermod -l newuser olduser     $ sudo groupmod -n newuser olduser     $ sudo usermod -d /home/newuser -m newuser</code></li>

<li>Disable users
<code>shell     passwd -l username  to lock , passwd -u username to unlock</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-web" class="outline-2">
<h2 id="web"><span class="section-number-2">7.</span> Web</h2>
<div class="outline-text-2" id="text-web">
</div>
<div id="outline-container-website" class="outline-3">
<h3 id="website"><span class="section-number-3">7.1.</span> Website</h3>
<div class="outline-text-3" id="text-website">
<ul class="org-ul">
<li><p>
Password Protected Website
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">To protect a directory called 'SecDir' on your website,</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">go to SecDir and create/edit .htaccess file as follows:</span>
AuthName <span style="color: #98be65;">"MySecDir"</span>
AuthType Basic
AuthUserFile /path/to/.htpasswd
require valid-user

$ htpasswd -c /path/to/.htpasswd guestname <span style="color: #5B6268;">#</span><span style="color: #5B6268;">create a passwod</span>
$ chmod 644 /path/to/.htpasswd   <span style="color: #5B6268;">#</span><span style="color: #5B6268;">change permission</span>

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">to log in SecDir online, enter username: guestname and passwod: yourpass</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-webserver" class="outline-3">
<h3 id="webserver"><span class="section-number-3">7.2.</span> Webserver</h3>
<div class="outline-text-3" id="text-webserver">
<ul class="org-ul">
<li><p>
Run a local server
</p>
<pre class="example">
$ cd /path/to/dir     
$ python -m SimpleHTTPServer #optional, can also enter the port e.g., 8080
</pre></li>
</ul>
</div>
</div>


<div id="outline-container-table-of-contents-in-markdown" class="outline-3">
<h3 id="table-of-contents-in-markdown"><span class="section-number-3">7.3.</span> Table of Contents in Markdown</h3>
<div class="outline-text-3" id="text-table-of-contents-in-markdown">
<ul class="org-ul">
<li>Use <code>gh-md-toc</code>, e.g.,  <code>$ gh-md-toc --insert cmds.md</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-mac-os" class="outline-2">
<h2 id="mac-os"><span class="section-number-2">8.</span> MAC OS</h2>
<div class="outline-text-2" id="text-mac-os">
<ul class="org-ul">
<li><p>
Creating an ISO from a CD/DVD e.g., to back up CD
</p>
<pre class="example">
- Insert CD
- open Disk Utils
- Select the CD (not the drive)
- Create File / New / Disk Image from ... / 
- Image Format:  CD/DVD Master  ...
- rename cdr to iso
</pre></li>
</ul>


<ul class="org-ul">
<li>Burn ISO image to USB (e.g., to install Linux distribution from USB)

<ul class="org-ul">
<li><p>
First convert ISO to dmg file
</p>
<pre class="example">
$ hdiutil convert -format UDRW -o ~/file.img ~/file.iso     
...
Speed: 427.5Mbytes/sec     Savings: 0.0%     created: ~/file.img.dmg
</pre></li>

<li><p>
Then find the USB device
</p>
<div class="org-src-container">
<pre class="src src-shell">$ diskutil list
/dev/disk0
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">:             TYPE NAME          SIZE     IDENTIFIER</span>
0:    GUID_partition_scheme            *320.1 GB   disk0
1:            EFI             209.7 MB   disk0s1
2:          Apple_HFS Mac           319.7 GB   disk0s2
/dev/disk1
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">:             TYPE NAME          SIZE     IDENTIFIER</span>
0:   FDisk_partition_scheme            *2.0 GB   disk1
1:       Windows_FAT_32             2.0 GB   disk1s1

$ diskutil unmountDisk /dev/disk1
Unmount of all volumes on disk1 was successful
</pre>
</div></li>

<li><p>
Finally, copy data to USB disk
</p>

<div class="org-src-container">
<pre class="src src-shell">$ sudo dd <span style="color: #dcaeea;">if</span>=/Users/tnguyen/file.img.dmg <span style="color: #dcaeea;">of</span>=/dev/disk1 <span style="color: #dcaeea;">bs</span>=1m
687+1 records<span style="color: #51afef;"> in</span>
687+1 records out
721127424 bytes transferred<span style="color: #51afef;"> in</span> 77.176835 secs (9343833 bytes/sec)

$ diskutil eject /dev/disk1
Disk /dev/disk1 ejected
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
