docs/nguyen/org/useful_cmds.org
** Virtual Box
   :PROPERTIES:
   :CUSTOM_ID: virtual-box
   :END:

   - SSH from Host OS to Virtualbox (VB) Guest OS using port forwarding.
     For example, I run Linux (Debian) on my Mac and often ssh (from my
     Mac) to that Linux run.

     1. The following assumes the VB Guest is called =myserver=. Also make
        sure the ssh server is installed on =myserver=.

     2. The Guest OS, by default, should have one interface already which
        is using NAT. First go to the =Network= settings
        =Advanced/Port Forwarding=, and then add a new rule:

        #+begin_src shell
          Host port 2222, guest port 22, name ssh, other left blank
        #+end_src

        or from command line

        #+begin_src shell
          HostOS$ VBoxManage modifyvm myserver --natpf1 "ssh,tcp,,2222,,22"
        #+end_src

     3. To check the added rules:

        #+begin_src shell
          HostOS$ VBoxManage showvminfo myserver | grep 'Rule'
          NIC 1 Rule(0):   name = ssh, protocol = tcp, host ip = , host port = 2222, guest ip = ..., guest port = 22
        #+end_src

     4. Log in the Guest OS =HostOS$ ssh -p 2222 username@localhost= where
        =username= is your user name in =myserver=.

   - Others:

     - Setup /password-less/ login so that we don't have to enter the
       password everytime.

       #+begin_src shell
         HostOS$ cat ~/.ssh/id_rsa.pub | ssh username@localhost -p 2222 'cat >> ~/.ssh/authorized_keys'
       #+end_src

     - Copy files from host to guest using scp, or vice versa

       #+begin_src shell
         #copy from host to guest
         HostOS$ scp -P 2223 /path/to/file   fse16ae@localhost:/destination/dir

         #copy from guest to host
         HostOS$ scp -P 2222 user@localhost:/path/to/file /destination/dir
       #+end_src

       Note that to add another Guest OS, use the same technique but choose
       different port number on the host OS, e.g., 2223.

     - Start Headless

       #+begin_src shell
         # List virtual machines
         HostOS$ VBoxManage list vms

         # Start VM in headless mode
         HostOS$ VBoxManage startvm Debian7 --type headless

         # Power off VM
         HostOS$ VBoxManage controlvm Debian7 poweroff
       #+end_src

** Emacs
   :PROPERTIES:
   :CUSTOM_ID: emacs
   :END:

*** Useful keys
    :PROPERTIES:
    :CUSTOM_ID: useful-keys
    :END:
    #+begin_example
      M-x load-file
      C-x k : kill buffer
      C-x C-x:  start a a location l,  search for something to go to new location,  then press C-x C-x to return back to l
      M-x occur:  search all line with matched regexp
      C-x C-r : read only
      C-x C-v:  reload file (not technically but it works well)
      C-c {  in latex mode to create {}
      C-j  insert paragraph break
      C-c C-s:  insert section subsection paragraph and label
      C-c C-e: insert environment (e.g. figure, equation, list etc)
      C-c C-f C-e:  emphasize
      C-c %   or  ;  :  comment out the paragraph or line
      C-c C-r:  on a highlighted region to latex only that region
      C-c C-c:  to run latex.
      C-c `:  keep on pressing this to review  errors after running latex
      C-/:  undo
      C-x k: kill buffer
      M-/: autocomplete
      M-h : mark entire paragraph
      C-x h: mark entire buffer
      C-t: transpose 2 letters  , e.g.  letet C-t  => lette
      M-t: transpose 2 words,  e.g.,  world hello  M-t  ->  hello word  ;   vu, nguyen M-t  => nguyen, vu  (note: cursor btw the 2 words,  Alt-b to move back a word)
      C-x C-t: transpose 2 lines
      M-u : uppercase letters
      M-c : capitalize letters
      C-s C-w:  to the end of the word (handy)
      Search and replace
      C-s twice to redo the last  search
      C-s C-w  search the word under the cursor

      ;; Windows resize
      C-x + : make windows same height/width
      C-x - : shrink window to fit content

      M-x package-refresh-contents:  to refresh melpa content

      ;; Tramp: open remote files via ssh
      open /ssh:user@host#port:/path

      ;; Tab
      untabify / tabify to convert from tab to space and space to tab.
    #+end_example

*** TeX
    :PROPERTIES:
    :CUSTOM_ID: tex
    :END:
    #+begin_example
      M-x align-current: To align columns in LaTeX table, highlight the table region, then M-x align-current
    #+end_example

*** Install Flyspell on Mac
    :PROPERTIES:
    :CUSTOM_ID: install-flyspell-on-mac
    :END:

    - Install =cocoAspell= (which provides aspell)
    - Install the appropriate /dictionary/
      (=./configure; make; make install=)

*** TexLive
    :PROPERTIES:
    :CUSTOM_ID: texlive
    :END:
    #+begin_src shell
      $ tlmgr update --self
      $ tlmgr update --all # update TexLive packages installation (Mac)
      $ tlmgr update --list  # see what will be upgraded
    #+end_src
