people/nguyenthanhvuh/old/posts/useful_cmds.html

<div id="outline-container-virtual-box" class="outline-2">
<h2 id="virtual-box"><span class="section-number-2">9.</span> Virtual Box</h2>
<div class="outline-text-2" id="text-virtual-box">
<ul class="org-ul">
<li>SSH from Host OS to Virtualbox (VB) Guest OS using port forwarding.
For example, I run Linux (Debian) on my Mac and often ssh (from my
Mac) to that Linux run.

<ol class="org-ol">
<li>The following assumes the VB Guest is called <code>myserver</code>. Also make
sure the ssh server is installed on <code>myserver</code>.</li>

<li><p>
The Guest OS, by default, should have one interface already which
is using NAT. First go to the <code>Network</code> settings
<code>Advanced/Port Forwarding</code>, and then add a new rule:
</p>

<div class="org-src-container">
<pre class="src src-shell">Host port 2222, guest port 22, name ssh, other left blank
</pre>
</div>

<p>
or from command line
</p>

<div class="org-src-container">
<pre class="src src-shell">HostOS$ VBoxManage modifyvm myserver --natpf1 <span style="color: #98be65;">"ssh,tcp,,2222,,22"</span>
</pre>
</div></li>

<li><p>
To check the added rules:
</p>

<div class="org-src-container">
<pre class="src src-shell">HostOS$ VBoxManage showvminfo myserver | grep <span style="color: #98be65;">'Rule'</span>
NIC 1 Rule(0):   name = ssh, protocol = tcp, host ip = , host port = 2222, guest ip = ..., guest port = 22
</pre>
</div></li>

<li>Log in the Guest OS <code>HostOS$ ssh -p 2222 username@localhost</code> where
<code>username</code> is your user name in <code>myserver</code>.</li>
</ol></li>

<li>Others:

<ul class="org-ul">
<li><p>
Setup <i>password-less</i> login so that we don't have to enter the
password everytime.
</p>

<div class="org-src-container">
<pre class="src src-shell">HostOS$ cat ~/.ssh/id_rsa.pub | ssh username@localhost -p 2222 <span style="color: #98be65;">'cat &gt;&gt; ~/.ssh/authorized_keys'</span>
</pre>
</div></li>

<li><p>
Copy files from host to guest using scp, or vice versa
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;">#</span><span style="color: #5B6268;">copy from host to guest</span>
HostOS$ scp -P 2223 /path/to/file   fse16ae@localhost:/destination/dir

<span style="color: #5B6268;">#</span><span style="color: #5B6268;">copy from guest to host</span>
HostOS$ scp -P 2222 user@localhost:/path/to/file /destination/dir
</pre>
</div>

<p>
Note that to add another Guest OS, use the same technique but choose
different port number on the host OS, e.g., 2223.
</p></li>

<li><p>
Start Headless
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">List virtual machines</span>
HostOS$ VBoxManage list vms

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Start VM in headless mode</span>
HostOS$ VBoxManage startvm Debian7 --type headless

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Power off VM</span>
HostOS$ VBoxManage controlvm Debian7 poweroff
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-emacs" class="outline-2">
<h2 id="emacs"><span class="section-number-2">10.</span> Emacs</h2>
<div class="outline-text-2" id="text-emacs">
</div>

<div id="outline-container-useful-keys" class="outline-3">
<h3 id="useful-keys"><span class="section-number-3">10.1.</span> Useful keys</h3>
<div class="outline-text-3" id="text-useful-keys">
<pre class="example" id="org38738e3">
M-x load-file
C-x k : kill buffer
C-x C-x:  start a a location l,  search for something to go to new location,  then press C-x C-x to return back to l
M-x occur:  search all line with matched regexp
C-x C-r : read only
C-x C-v:  reload file (not technically but it works well)
C-c {  in latex mode to create {}
C-j  insert paragraph break
C-c C-s:  insert section subsection paragraph and label
C-c C-e: insert environment (e.g. figure, equation, list etc)
C-c C-f C-e:  emphasize
C-c %   or  ;  :  comment out the paragraph or line
C-c C-r:  on a highlighted region to latex only that region
C-c C-c:  to run latex.
C-c `:  keep on pressing this to review  errors after running latex
C-/:  undo
C-x k: kill buffer
M-/: autocomplete
M-h : mark entire paragraph
C-x h: mark entire buffer
C-t: transpose 2 letters  , e.g.  letet C-t  =&gt; lette
M-t: transpose 2 words,  e.g.,  world hello  M-t  -&gt;  hello word  ;   vu, nguyen M-t  =&gt; nguyen, vu  (note: cursor btw the 2 words,  Alt-b to move back a word)
C-x C-t: transpose 2 lines
M-u : uppercase letters
M-c : capitalize letters
C-s C-w:  to the end of the word (handy)
Search and replace
C-s twice to redo the last  search
C-s C-w  search the word under the cursor

;; Windows resize
C-x + : make windows same height/width
C-x - : shrink window to fit content

M-x package-refresh-contents:  to refresh melpa content

;; Tramp: open remote files via ssh
open /ssh:user@host#port:/path

;; Tab
untabify / tabify to convert from tab to space and space to tab.
</pre>
</div>
</div>

<div id="outline-container-tex" class="outline-3">
<h3 id="tex"><span class="section-number-3">10.2.</span> TeX</h3>
<div class="outline-text-3" id="text-tex">
<pre class="example" id="org0ae0427">
M-x align-current: To align columns in LaTeX table, highlight the table region, then M-x align-current
</pre>
</div>
</div>

<div id="outline-container-install-flyspell-on-mac" class="outline-3">
<h3 id="install-flyspell-on-mac"><span class="section-number-3">10.3.</span> Install Flyspell on Mac</h3>
<div class="outline-text-3" id="text-install-flyspell-on-mac">
<ul class="org-ul">
<li>Install <code>cocoAspell</code> (which provides aspell)</li>
<li>Install the appropriate <i>dictionary</i>
(<code>./configure; make; make install</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-texlive" class="outline-3">
<h3 id="texlive"><span class="section-number-3">10.4.</span> TexLive</h3>
<div class="outline-text-3" id="text-texlive">
<div class="org-src-container">
<pre class="src src-shell">$ tlmgr update --self
$ tlmgr update --all <span style="color: #5B6268;"># </span><span style="color: #5B6268;">update TexLive packages installation (Mac)</span>
$ tlmgr update --list  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">see what will be upgraded</span>
</pre>
</div>
</div>
</div>
</div>
<div class="taglist"><a href="./tags.html">Tags</a>: <a href="./tag-computer.html">computer</a> <a href="./tag-setup.html">setup</a> <a href="./tag-blog.html">blog</a> <a href="./tag-linux.html">linux</a> </div></div>
<div id="postamble" class="status"><!-- <div id="archive"><a href="archive.html">Other posts</a></div>  -->
</div>
</body>
</html>
